Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Type
The type of the parameter definition to be created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: e cannot be Invalid or FamilyType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.#ctor(System.String,Autodesk.Revit.DB.ParameterType)
Constructs the options using a specified name and type.
name:
The name of the parameter definition to be created.
type:
The name of the parameter type for the new definition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
type cannot be Invalid or FamilyType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015